app/views/collaborators/new.html.erb


  <%= f.select :user_id, options_for_select(User.where.not(id: @wiki.user.id).pluck(:email, :id)) %>
---
SELECT "users"."id" FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 99]]