app/controllers/collaborators_controller.rb

  def new
    @wiki = Wiki.find(params[:wiki_id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 99], ["LIMIT", 1]]

  def index
    @wiki = Wiki.find(params[:wiki_id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 99], ["LIMIT", 1]]

  def create
    @wiki = Wiki.find(params[:wiki_id])
    @collaborator_user = User.find(params[:collaborator][:user_id])

    if @wiki.collaborators.exists?(user_id: @collaborator_user.id)
      flash[:notice] = "#{@collaborator_user.email} is already a collaborator."
      redirect_to edit_wiki_path(@wiki)
    else
      @collaborator = Collaborator.new(wiki_id: @wiki.id, user_id: @collaborator_user.id)
      if @collaborator.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 99], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  1 AS one FROM "collaborators" WHERE "collaborators"."wiki_id" = ? AND "collaborators"."user_id" = ? LIMIT ?  [["wiki_id", 99], ["user_id", 4], ["LIMIT", 1]]
INSERT INTO "collaborators" ("user_id", "wiki_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["wiki_id", 99], ["created_at", "2017-11-21 02:14:29.351703"], ["updated_at", "2017-11-21 02:14:29.351703"]]

  def destroy
    @wiki = Wiki.find(params[:wiki_id])
    @collaborator = Collaborator.find(params[:id])
    @collaborator_user = User.find(@collaborator.user_id)

    if @collaborator.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 99], ["LIMIT", 1]]
SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 1]]