app/controllers/wikis_controller.rb

  def edit
    @collaborating_users = @wiki.users
    @users = User.all - @collaborating_users
---
SELECT "users".* FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 157]]