app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis" ORDER BY created_at DESC
---
  def index
    @wikis = Wiki.all

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 98], ["LIMIT", 1]]
---
  def show
    @wiki = Wiki.find(params[:id])

INSERT INTO "wikis" ("title", "body", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "lkjasdfasdf"], ["body", "asdfkjlasdfasdfasdf"], ["private", "t"], ["user_id", 14], ["created_at", "2017-11-28 02:48:34.639035"], ["updated_at", "2017-11-28 02:48:34.639035"]]
---
  def create
    @user = current_user
    @wiki = Wiki.new(user: current_user)
    authorize @wiki
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]

    if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 94], ["LIMIT", 1]]
---
  def edit
    @wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 99], ["LIMIT", 1]]
---
  def update
    @wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]
---
  def destroy
    @wiki = Wiki.find(params[:id])
    authorize @wiki

    if @wiki.destroy